{
  "bookReference": "Português - Livro 1 - Frente A",
  "modules": [
    {
      "moduleTitle": "MÓDULO 01: HISTORIOGRAFIA DA LÍNGUA PORTUGUESA",
      "sourceReference": "Frente A // L01 (p. 6-7)",
      "flashcards": [
        {
          "id": "M01C01",
          "leftColumnNodes": [
            "Latim Vulgar",
            "Substrato Linguístico",
            "Superstrato Linguístico",
            "Adstrato Linguístico",
            "\"Relusitanização\" (Brasil)"
          ],
          "rightColumnNodes": [
            {
              "text": "Variante popular e falada do latim, difundida pelos soldados, colonos e comerciantes romanos, sendo a base principal das línguas românicas.",
              "isDistractor": false,
              "distractorExplanation": ""
            },
            {
              "text": "Língua de um povo dominado que, mesmo desaparecendo, influencia a fonética, léxico ou gramática da língua do povo dominador que se impõe sobre ela (ex: línguas celtas e ibéricas na Península Ibérica).",
              "isDistractor": false,
              "distractorExplanation": ""
            },
            {
              "text": "Língua de um povo invasor que, embora não consiga se impor sobre a língua local, deixa nela influências lexicais e fonéticas antes de ser assimilado (ex: línguas germânicas sobre o latim vulgar na Ibéria).",
              "isDistractor": false,
              "distractorExplanation": ""
            },
            {
              "text": "Língua literária e erudita do Império Romano, utilizada em documentos oficiais e obras clássicas de autores como Cícero e Virgílio.",
              "isDistractor": true,
              "distractorExplanation": "Este é o Latim Clássico, diferente do Latim Vulgar que deu origem ao português."
            },
            {
              "text": "Língua que convive com outra em um mesmo território ou em fronteiras, exercendo influência mútua sem que uma suplante a outra (ex: o árabe em relação ao latim vulgar na Península Ibérica durante séculos).",
              "isDistractor": false,
              "distractorExplanation": ""
            },
            {
              "text": "Processo de intensificação da influência do português europeu no Brasil, ocorrido principalmente a partir da chegada da Corte Portuguesa em 1808, buscando maior aproximação com a norma da metrópole.",
              "isDistractor": false,
              "distractorExplanation": ""
            },
            {
              "text": "Processo de criação de uma língua totalmente nova a partir da mistura igualitária de duas outras, resultando em gramática simplificada.",
              "isDistractor": true,
              "distractorExplanation": "Isso descreve a formação de uma Língua Crioula, que é um fenômeno de contato linguístico, mas distinto dos conceitos de substrato, superstrato ou adstrato específicos."
            }
          ],
          "gabarito": [
            {"leftIndex": 0, "rightIndex": 0},
            {"leftIndex": 1, "rightIndex": 1},
            {"leftIndex": 2, "rightIndex": 2},
            {"leftIndex": 3, "rightIndex": 4},
            {"leftIndex": 4, "rightIndex": 5}
          ]
        }
      ]
    },
    {
      "moduleTitle": "MÓDULO 02: FONÉTICA, FONOLOGIA E ACENTUAÇÃO",
      "sourceReference": "Frente A // L01 (p. 13-16)",
      "flashcards": [
        {
          "id": "M02C01",
          "leftColumnNodes": [
            "Fonema",
            "Dígrafo Consonantal",
            "Hiato Tônico (regra específica)",
            "Acento Diferencial",
            "Proparoxítona"
          ],
          "rightColumnNodes": [
            {
              "text": "Menor unidade sonora de uma língua capaz de estabelecer distinção de significado entre palavras (ex: /p/ e /b/ em \"pata\" e \"bata\").",
              "isDistractor": false,
              "distractorExplanation": ""
            },
            {
              "text": "Sequência de duas letras que representam um único som consonantal (ex: \"ch\" em chave, \"lh\" em alho, \"ss\" em osso).",
              "isDistractor": false,
              "distractorExplanation": ""
            },
            {
              "text": "Letra ou conjunto de letras que representam um fonema na escrita.",
              "isDistractor": true,
              "distractorExplanation": "Esta é a definição de Grafema, a representação escrita, não o som em si."
            },
            {
              "text": "Ocorrência de \"i\" ou \"u\" como segunda vogal tônica de um hiato, geralmente acentuada graficamente, a menos que seguida de \"nh\" na sílaba seguinte (ex: sa-í-da, mas ra-i-nha) ou precedida de ditongo em paroxítonas (ex: Sauipe).",
              "isDistractor": false,
              "distractorExplanation": ""
            },
            {
              "text": "Acento gráfico utilizado para distinguir palavras homógrafas, mas com classes gramaticais ou tempos verbais diferentes (ex: pôr (verbo) vs. por (preposição); pôde (pret. perf. ind.) vs. pode (pres. ind.)).",
              "isDistractor": false,
              "distractorExplanation": ""
            },
            {
              "text": "Palavra cuja sílaba tônica é a antepenúltima, sendo todas, sem exceção, acentuadas graficamente (ex: lâmpada, médico).",
              "isDistractor": false,
              "distractorExplanation": ""
            },
            {
              "text": "Encontro de uma vogal e uma semivogal (ou vice-versa) na mesma sílaba.",
              "isDistractor": true,
              "distractorExplanation": "Esta é a definição de Ditongo, um tipo de encontro vocálico, não uma regra de acentuação específica como o hiato tônico."
            }
          ],
          "gabarito": [
            {"leftIndex": 0, "rightIndex": 0},
            {"leftIndex": 1, "rightIndex": 1},
            {"leftIndex": 2, "rightIndex": 3},
            {"leftIndex": 3, "rightIndex": 4},
            {"leftIndex": 4, "rightIndex": 5}
          ]
        }
      ]
    },
    {
      "moduleTitle": "MÓDULO 03: MORFOLOGIA",
      "sourceReference": "Frente A // L01 (p. 21-22)",
      "flashcards": [
        {
          "id": "M03C01",
          "leftColumnNodes": [
            "Morfema Lexical (Radical)",
            "Desinência Modo-Temporal",
            "Vogal Temática Nominal",
            "Tema Verbal",
            "Consoante de Ligação"
          ],
          "rightColumnNodes": [
            {
              "text": "Unidade mínima significativa que contém o sentido básico, fundamental da palavra, comum a um grupo de palavras cognatas (ex: *terr-* em terra, terreno, aterrar).",
              "isDistractor": false,
              "distractorExplanation": ""
            },
            {
              "text": "Morfema verbal que se anexa ao tema para indicar o modo e o tempo em que o processo verbal ocorre (ex: *-va-* em cantávamos indica pretérito imperfeito do indicativo).",
              "isDistractor": false,
              "distractorExplanation": ""
            },
            {
              "text": "Morfema que se antepõe ao radical para modificar seu sentido ou criar nova palavra.",
              "isDistractor": true,
              "distractorExplanation": "Esta é a definição de Prefixo, um tipo de afixo derivacional."
            },
            {
              "text": "Vogal que se junta ao radical de um nome para constituir o tema (ex: cas**a**, post**e**, livr**o**). Em nomes, ajuda a formar a palavra primitiva e não indica oposição de gênero como as desinências.",
              "isDistractor": false,
              "distractorExplanation": ""
            },
            {
              "text": "Segmento formado pelo radical do verbo mais a sua vogal temática, ao qual se juntam as desinências verbais (ex: *canta-* em cantávamos).",
              "isDistractor": false,
              "distractorExplanation": ""
            },
            {
              "text": "Morfema que indica o gênero (masculino/feminino) e o número (singular/plural) dos nomes.",
              "isDistractor": true,
              "distractorExplanation": "Esta é a definição de Desinência Nominal (de gênero e número), distinta da vogal temática nominal."
            },
            {
              "text": "Elemento fonético sem significado próprio, inserido entre dois morfemas para facilitar a pronúncia ou por eufonia, não sendo, portanto, um morfema (ex: o *-l-* em chaleira, o *-z-* em cafezal).",
              "isDistractor": false,
              "distractorExplanation": ""
            }
          ],
          "gabarito": [
            {"leftIndex": 0, "rightIndex": 0},
            {"leftIndex": 1, "rightIndex": 1},
            {"leftIndex": 2, "rightIndex": 3},
            {"leftIndex": 3, "rightIndex": 4},
            {"leftIndex": 4, "rightIndex": 6}
          ]
        }
      ]
    },
    {
      "moduleTitle": "MÓDULO 04: PROCESSO DE FORMAÇÃO DE PALAVRAS",
      "sourceReference": "Frente A // L01 (p. 25-28)",
      "flashcards": [
        {
          "id": "M04C01",
          "leftColumnNodes": [
            "Derivação Parassintética",
            "Composição por Aglutinação",
            "Hibridismo",
            "Derivação Imprópria (Conversão)",
            "Neologismo Semântico"
          ],
          "rightColumnNodes": [
            {
              "text": "Processo em que um prefixo e um sufixo são adicionados simultaneamente a uma palavra primitiva, de tal forma que a palavra resultante não existe apenas com o prefixo ou apenas com o sufixo (ex: en-trist-ecer, a-noit-ecer).",
              "isDistractor": false,
              "distractorExplanation": ""
            },
            {
              "text": "Processo de formação de uma nova palavra pela união de dois ou mais radicais, ocorrendo alteração fonética em pelo menos um dos elementos formadores, com perda de fonemas (ex: planalto de plano + alto; aguardente de água + ardente).",
              "isDistractor": false,
              "distractorExplanation": ""
            },
            {
              "text": "Processo de formação pela união de radicais sem alteração fonética, mantendo a integridade dos elementos.",
              "isDistractor": true,
              "distractorExplanation": "Isso descreve a Composição por Justaposição (ex: guarda-chuva), diferente da aglutinação."
            },
            {
              "text": "Formação de uma palavra pela combinação de elementos (radicais, prefixos, sufixos) oriundos de línguas diferentes (ex: automóvel (grego + latim); sociologia (latim + grego); sambódromo (africano + grego)).",
              "isDistractor": false,
              "distractorExplanation": ""
            },
            {
              "text": "Processo de formação de palavras que consiste na mudança da classe gramatical de uma palavra já existente, sem que sua forma sofra qualquer alteração (ex: O jantar (substantivo) estava delicioso, derivado de jantar (verbo)).",
              "isDistractor": false,
              "distractorExplanation": ""
            },
            {
              "text": "Atribuição de um novo significado a uma palavra que já existe na língua, mantendo sua forma original (ex: \"navegar\" na internet; \"zebra\" como resultado inesperado; \"mala\" como pessoa inconveniente).",
              "isDistractor": false,
              "distractorExplanation": ""
            },
            {
              "text": "Processo de redução de uma palavra ou expressão, geralmente pela omissão de fonemas ou sílabas finais.",
              "isDistractor": true,
              "distractorExplanation": "Isso descreve a Abreviação Vocabular (ex: \"foto\" de fotografia, \"pneu\" de pneumático), que é um processo de simplificação, não de atribuição de novo sentido a uma palavra completa."
            }
          ],
          "gabarito": [
            {"leftIndex": 0, "rightIndex": 0},
            {"leftIndex": 1, "rightIndex": 1},
            {"leftIndex": 2, "rightIndex": 3},
            {"leftIndex": 3, "rightIndex": 4},
            {"leftIndex": 4, "rightIndex": 5}
          ]
        }
      ]
    }
  ]
}