{
  "bookReference": "Biologia - Livro 04 - Frente B",
  "modules": [
    {
      "moduleTitle": "MÓDULO 13: EMBRIOLOGIA HUMANA: ETAPAS INICIAIS E POTENCIAL CELULAR",
      "sourceReference": "Frente B // L04 (p. 416-421)",
      "flashcards": [
        {
          "id": "M13B01",
          "leftColumnNodes": [
            "Zigoto",
            "Mórula",
            "Blastocisto",
            "Gastrulação",
            "Células-tronco totipotentes",
            "Células-tronco pluripotentes",
            "Sinciciotrofoblasto"
          ],
          "rightColumnNodes": [
            {
              "text": "Célula diploide primordial resultante da fusão dos pronúcleos masculino e feminino, marcando o início ontogenético de um novo indivíduo.",
              "isDistractor": false,
              "distractorExplanation": ""
            },
            {
              "text": "Estágio embrionário inicial, pré-implantação, caracterizado por um aglomerado compacto de blastômeros, cujas células ainda retêm totipotência.",
              "isDistractor": false,
              "distractorExplanation": ""
            },
            {
              "text": "Estrutura embrionária que sucede a mórula, contendo uma cavidade (blastocele), uma massa celular interna (embrioblasto) e uma camada externa (trofoblasto), sendo o estágio de implantação uterina.",
              "isDistractor": false,
              "distractorExplanation": ""
            },
            {
              "text": "Processo morfogenético crítico que transforma o embrião bilaminar em trilaminar, estabelecendo os três folhetos germinativos (ectoderma, mesoderma, endoderma) e os eixos corporais primários.",
              "isDistractor": false,
              "distractorExplanation": ""
            },
            {
              "text": "Células com a capacidade intrínseca de gerar um organismo completo e funcional, incluindo todos os tecidos embrionários e estruturas extraembrionárias como placenta e anexos.",
              "isDistractor": false,
              "distractorExplanation": ""
            },
            {
              "text": "Células derivadas da massa celular interna do blastocisto, capazes de se diferenciar em qualquer tipo celular dos três folhetos germinativos, mas não de formar independentemente as estruturas extraembrionárias necessárias para um organismo completo.",
              "isDistractor": false,
              "distractorExplanation": ""
            },
            {
              "text": "Componente externo e invasivo do trofoblasto, caracterizado por uma massa citoplasmática multinucleada que erode o endométrio materno, facilita a nidação e secreta hCG para sustentar o corpo lúteo.",
              "isDistractor": false,
              "distractorExplanation": ""
            },
            {
              "text": "Fase do desenvolvimento embrionário marcada pela formação da placa neural, pregas neurais e tubo neural, originando o sistema nervoso central; sucede a gastrulação.",
              "isDistractor": true,
              "distractorExplanation": "Esta é a definição de Neurulação, um processo de desenvolvimento posterior e distinto dos itens da coluna 1, embora relacionado à embriogênese."
            },
            {
              "text": "Anexo embrionário que forma uma bolsa preenchida por líquido, envolvendo e protegendo o embrião contra choques mecânicos e desidratação.",
              "isDistractor": true,
              "distractorExplanation": "Esta é a descrição do Âmnio, um anexo embrionário. Embora relevante para o desenvolvimento, não é um dos termos da coluna da esquerda."
            },
            {
              "text": "Série de divisões mitóticas rápidas que o zigoto sofre, resultando em um aumento no número de células (blastômeros) sem aumento significativo no tamanho total do embrião.",
              "isDistractor": true,
              "distractorExplanation": "Descreve o processo de Clivagem (ou segmentação), que leva à formação da mórula, mas não é uma das estruturas ou tipos celulares específicos listados na coluna da esquerda."
            }
          ],
          "gabarito": [
            {"leftIndex": 0, "rightIndex": 0},
            {"leftIndex": 1, "rightIndex": 1},
            {"leftIndex": 2, "rightIndex": 2},
            {"leftIndex": 3, "rightIndex": 3},
            {"leftIndex": 4, "rightIndex": 4},
            {"leftIndex": 5, "rightIndex": 5},
            {"leftIndex": 6, "rightIndex": 6}
          ]
        }
      ]
    }
  ]
}
